// Мода — это число, которое встречается чаще всего в числовом ряду (более одного раза).
// Если несколько чисел встречаются одинаковое количество раз, то последовательность имеет несколько мод.
// Например:
// ряд 3 6 7 1 3 имеет моду равную 3, которое встречается два раза;
// ряд 1 9 2 6 7 вообще не имеет моды, так как все числа не повторяются;
// ряд 1 1 2 3 3 2 3 2 имеет две моды: 2 и 3, которые повторяются по три раза.
// 1 модой не будет, так как она встречается меньшее количество раз.
// Напишите функцию Mode() которая вычисляет моды числового ряда и возвращает два значения:
// []int — список мод. Числа должны быть отсортированы по возрастанию;
// int — количество повторений моды.
// Если числовой ряд пустой или моды отсутствуют, то должен возвращаться пустой слайс
// и единица для количества повторений.

package main

import (
	"fmt"
	"sort" // или
	//"slices"
)

// Mode возвращает моды числовой последовательности.

func Mode(s []int) ([]int, int) {

	if len(s) == 0 { //проверяем условие "Если числовой ряд пустой или моды отсутствуют,
		return []int{}, 1 //то должен возвращаться пустой слайс "

	}

	//Подсчет частот

	freq := make(map[int]int) //создаем мапу , проходим циклом по исходному слайсу s[]int
	for _, num := range s {

		freq[num]++ /* так в мапу добавляется значение из слайса (в ключ мапы), если оно не встречалось ранее,
			               одновременно увеличивается счетчик для значений мапы на 1.
			               num[0](первое значение)  {1} (встретилось 1 раз)
		                   num[1](следующее значение) {1}(встретолось 1 раз)
			               если значение , равное num[1] встретилось еще раз:
			               num[0] {1}
			               num[2] {2}*/
	}

	var modes []int // создаем пустой слайс, куда будут помещаться максимальные и минимальные значения
	maxCount := 0   // переменная для подсчета и сравнения количества сколько раз данное число встретилось в мапе

	// 3. Поиск максимальной частоты
	for num, count := range freq { //цикл по мапе

		if count > maxCount { // если нашлось значение count, которое больше предыдущего
			// Нашли новую максимальную частоту -> сбрасываем список мод
			maxCount = count   // добавляем новое значение в переменную maxCount для вывода
			modes = []int{num} // и кладем значение ключа мапы freq в слайс modes
		} else if count == maxCount { // если нашлось число , которое столько же раз встретилось в мапе(т.е. значение мапы
			// такое же, как в переменной maxCount)
			// Нашли число с такой же частотой -> добавляем в список
			modes = append(modes, num) // в мапу modes добавляется, а не перезаписывается новое значение num)
		}
		if maxCount <= 1 {
			return []int{}, 1
		}
	}

	// 4. Сортировка результата, чтобы порядок был предсказуемым (тесты чувствительны к порядку)
	sort.Ints(modes)

	return modes, maxCount
}
func main() {
	lists := [][]int{
		{},
		{57},
		{78, -7},
		{99, 200, 0},
		{4, 4, 4, 3},
		{102, -7, 44, -7, 102},
		{82, -23, 1, 5, 98, 100},
		{100000, 90000, 20000, 20000, 20000, 22000, 25500, 22000},
	}
	modes := [][]int{
		{}, {}, {}, {},
		{4},
		{-7, 102}, {},
		{20000},
	}
	mcount := []int{
		1, 1, 1, 1, 3, 2, 1, 3,
	}
	for i, list := range lists {
		mode, count := Mode(list)
		if len(mode) != len(modes[i]) {
			fmt.Printf("len mode %d: %v != %v'\n", i, modes[i], mode)
		} else {
			for j, v := range mode {
				if v != modes[i][j] {
					fmt.Printf("mode %d: %v != %v\n", i, modes[i], mode)
				}
			}
		}
		if count != mcount[i] {
			fmt.Printf("mcount %d: %d != %d\n", i, mcount[i], count)
		}
	}
	fmt.Println("Тестирование завершено")
}
