// 1.
// Вам нужно написать две простых функции, одна из которых вычисляет среднее арифметическое,
// а другая — размах числовой последовательности.
// Среднее арифметическое — это сумма всех чисел последовательности, разделённая на их количество.
// Напишите функцию Average(), которая возвращает среднее арифметическое элементов
// переданной ей последовательности. Функция должна возвращать число типа float64,
// так как сумма может не делиться нацело на количество чисел.  Это, пожалуй, самая простая функция.
// Тем более, что примеры с вычислением среднего арифметического
// уже встречались в курсе. Для пустой последовательности функция должна возвращать 0.
// Размах ряда — это разность между наибольшим и наименьшим числом в последовательности.
// Например, размах ряда 1 9 2 -3 7 5 равен 9-(-3) = 12. Напишите функцию Range(), которая возвращает
// размах числового ряда. Тип возвращаемого значения — int. Для пустой последовательности функция
// должна возвращать 0.

package main

import (
	"fmt"
	"math"
)

// Average возвращает среднее арифметическое элементов слайса []int.

func Average(ranges []int) float64 {

	if len(ranges) == 0 { // проверяем условие "Для пустой последовательности функция должна
		// возвращать 0."
		return 0
	}
	sum := 0                     // объявляем начальную переменную для суммы
	for _, num := range ranges { // итерация по слайсу ranges, получение значений,
		sum += num // получаем сумму всех значений из массива
	}
	return float64(sum) / float64(len(ranges)) //переводим все переменные во Float64 , делим сумму значений
	// на количество элементов в слайсе len(ranges)

}

// Range возвращает размах числовой последовательности.

func Range(list []int) int {
	if len(list) == 0 { // проверяем условие "Для пустой последовательности функция должна
		// возвращать 0."
		return 0
	}

	maxV := list[0] //объявляем начальные значения для максимума и минимума (значения из слайса с )
	minV := list[0] //индексом [0], т.е. первые в слайсе

	for _, num := range list {
		minV = min(minV, num) //функция из пакета "math" по нахождению максимума и минимума
		maxV = max(maxV, num) // массива num
	}
	return maxV - minV // выполняем условие "размах ряда"

}
func main() {
	lists := [][]int{
		{},
		{57},
		{78, -7},
		{99, 200, 0},
		{4, 4, 4, 3},
		{102, -7, 44, -7, 102},
		{82, -23, 1, 5, 98, 100},
		{100000, 90000, 20000, 20000, 20000, 22000, 25500, 22000},
	}
	averages := []float64{
		0, 57, 36, 100, 4, 47, 44, 39938,
	}
	ranges := []int{
		0, 0, 85, 200, 1, 109, 123, 80000,
	}

	for i, list := range lists {
		if average := math.Round(Average(list)); average != averages[i] {
			fmt.Printf("average %d: %.2f != %.2f\n", i, averages[i], average)
		}
		if r := Range(list); r != ranges[i] {
			fmt.Printf("range %d: %d != %d\n", i, ranges[i], r)
		}
	}
	fmt.Println("Тестирование завершено")
}
