// В этом задании вам придётся находить медиану. Чтобы вычислить медиану, нужно отсортировать числовой ряд.
// Если в упорядоченном ряду нечётное число членов, то медианой будет число по середине ряда.
// Если в упорядоченном ряду чётное число членов, то медиана будет равна среднему арифметическому
// двух средних чисел. Медиана часто даёт больше полезной информации, чем среднее арифметическое
// Сортировать нужно не слайс, который передан в параметре, а его копию, которую вам нужно
// предварительно создать.
// В случае пустой последовательности функция должна возвращать 0.

package main

import (
	"fmt"
	"sort" // или "slices"
)

// Median возвращает медиану числовой последовательности.

func Median(nums []int) int {
	if len(nums) == 0 { // проверяем условие "В случае пустой последовательности функция должна возвращать 0."
		return 0
	}
	copySlice := make([]int, len(nums)) // создаем копию слайса и называем ее "copySlice". Дальше работаем с ней.
	copy(copySlice, nums)

	sort.Ints(copySlice) // сортируем значения в массиве по возрастанию

	mid := len(copySlice) / 2 // находим серединное значение слайса copySlice

	if len(copySlice)%2 == 0 { // в случае ЧЕТНОГО количества значений :
		return (copySlice[mid] + copySlice[mid-1]) / 2 // складываем срединное значение [mid] и предыдущее,
		// делим эту сумму пополам
	}

	return copySlice[mid] // если значений нечетное количество, возвращаем серединное

}

func main() {
	lists := [][]int{
		{},
		{57},
		{78, -7},
		{99, 200, 0},
		{4, 4, 4, 3},
		{102, -7, 44, -7, 102},
		{82, -23, 1, 5, 98, 100},
		{100000, 90000, 20000, 20000, 20000, 22000, 25500, 22000},
	}
	medians := []int{
		0, 57, 35, 99, 4, 44, 43, 22000,
	}

	for i, list := range lists {
		if median := Median(list); median != medians[i] {
			fmt.Printf("median %d: %d != %d\n", i, medians[i], median)
		}
	}
	fmt.Println("Тестирование завершено")
}
